print("Hello, Python!")
first_name = "Nikolay"
# print("Hello, " + first_name +"!")

# a = 30
# b = "Hello"
# print (type(a))
# print (type(c))
# print (type(b))

# a = 5
# print (a, type(a))
# b = "Hello"
# # print (a, type(a))
# print(str(a + b)

# a = 5
# # print(a, id(a))#5
# #
# # b = 4
# # print(b, id(b)) #4
# #
# # a = b #4
# # print(a, id(a))

# a = b = c = 4
# print(a, b, c)

# a, b, c = 5, "Hello", 9.2
# print(a, b, c)

# PI = 3,14
# print(PI)
# PI = 2 # нарушение соглашения програмистов
# print(PI)

# a = 21
# b = 512
# print("a:", a) #2
# print("b:", b) #1
# a,b = b,a
# # c = a #c = 1
# # a = b #a = 2
# # b = c #b = 1
# print("a:", a) #2
# print("b:", b) #1

# print("Строка символов Строка символов Строка символов Строка символов Строка символов Строка символов\
# Строка символов  Строка символов Строка символов Строка символов Строка символов Строка символов Строка\
#  символов Строка символов Строка символов Строка символов Строка символов Строка символов Строка символов\
#   Строка символов Строка символов Строка символов Строка символов Строка символов Строка символов Строка символов\
#    Строка символов Строка символов Строка символов Строка символов Строка символов Строка символов Строка символов\
#    Строка символов Строка символов Строка символов Строка символов Строка символов Строка символов Строка символов\
#     Строка символов Строка символов Строка символов Строка символов Строка символов Строка символов Строка символов\
#      Строка символов Строка символов Строка символов Строка символов")
# print('Строка символов')

#print("Документ 'file.txt' находится по пути \rD:\\folder\\file.txt") /r -возврат корретки на начало строки все затирает

# s1 = "Hello"
# s2 = "Python"
# s3 = s1 + ", " + s2 + "!"
# print(s3) #"Hello, Python"
# print(s3 * 5)
# print("apple")


# print(625664464848484864648484844848484848484826265655)print(625664464848484864648484844848484848484826265655) - выделить текст + cntr+D - копирует текст на эту же строку

# print(6 + 2)
# print(6 - 2)
# print(6 * 2)
# print(6 / 2) #3
# print(6 /4) #1,5
# #оператор целочисленного деленияя
# print(6 //4) #3
# print(6 //4) #1
#
# print(6 ** 3)
# print(6 % 4)